package Основы.HomeWork2;

/* Строки. Ввод пароля.
 
	Написать программу ввода пароля пользователя. 
	Пользователь вводит пароль 2 раза (второй - подтверждение) 
	
	Пароль должен удовлетворять следующим требованиям:
	
	- длинна пароля должна быть от 8 до 20 символов;
	- в пароле должны быть как маленькие так и большие буквы;
	- должны быть цифры;
	- не должен содержать слов 'password', 'pass', 'gfhjkm';
	- пароль должен совпадать с подтверждением.
 */

public class Task9_EnterPassword {

	public static void main(String[] args) {

	}

} // доделать
